In [2]:
import pandas as pd
from datetime import datetime, time, date

In [20]:
start_date = "1998-01-01"

In [21]:
date_series = pd.date_range(start=start_date, periods=50*365, freq='D')
display(date_series)

DatetimeIndex(['1998-01-01', '1998-01-02', '1998-01-03', '1998-01-04',
               '1998-01-05', '1998-01-06', '1998-01-07', '1998-01-08',
               '1998-01-09', '1998-01-10',
               ...
               '2047-12-10', '2047-12-11', '2047-12-12', '2047-12-13',
               '2047-12-14', '2047-12-15', '2047-12-16', '2047-12-17',
               '2047-12-18', '2047-12-19'],
              dtype='datetime64[ns]', length=18250, freq='D')

In [22]:
print(type(date_series))

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

In [23]:
df = date_series.to_frame(name='date',index=False)

In [24]:
df['date']

0       1998-01-01
1       1998-01-02
2       1998-01-03
3       1998-01-04
4       1998-01-05
           ...
18245   2047-12-15
18246   2047-12-16
18247   2047-12-17
18248   2047-12-18
18249   2047-12-19
Name: date, Length: 18250, dtype: datetime64[ns]

In [29]:
df['day'] = df['date'].dt.day
df['month'] = df['date'].dt.month
df['year'] = df['date'].dt.year
df['day_of_week'] = df['date'].dt.day_of_week
df['day_of_year'] = df['date'].dt.day_of_year
df['days_in_month'] = df['date'].dt.days_in_month
df['quarter'] = df['date'].dt.quarter

In [31]:
df.tail()

,date,day,month,year,day_of_week,day_of_year,days_in_month,quarter
18245,2047-12-15,15,12,2047,6,349,31,4
18246,2047-12-16,16,12,2047,0,350,31,4
18247,2047-12-17,17,12,2047,1,351,31,4
18248,2047-12-18,18,12,2047,2,352,31,4
18249,2047-12-19,19,12,2047,3,353,31,4